zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_FLASH_CMPA.h
/*! @name VENDOR_USAGE - . */
/*! @{ */

#define FLASH_CMPA_VENDOR_USAGE_VENDOR_USAGE_MASK (0xFFFF0000U)
#define FLASH_CMPA_VENDOR_USAGE_VENDOR_USAGE_SHIFT (16U)
/*! VENDOR_USAGE - Upper 16 bits of vendor usage field defined in DAP. */
#define FLASH_CMPA_VENDOR_USAGE_VENDOR_USAGE(x)  (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_VENDOR_USAGE_VENDOR_USAGE_SHIFT)) & FLASH_CMPA_VENDOR_USAGE_VENDOR_USAGE_MASK)
/*! @} */

/*! @name SECURE_BOOT_CFG - . */
/*! @{ */

#define FLASH_CMPA_SECURE_BOOT_CFG_RSA4K_MASK    (0x3U)
#define FLASH_CMPA_SECURE_BOOT_CFG_RSA4K_SHIFT   (0U)
/*! RSA4K - Use RSA4096 keys only.
 *  0b00..Allow RSA2048 and higher
 *  0b01..RSA4096 only
 *  0b10..RSA4096 only
 *  0b11..RSA4096 only
 */
#define FLASH_CMPA_SECURE_BOOT_CFG_RSA4K(x)      (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_SECURE_BOOT_CFG_RSA4K_SHIFT)) & FLASH_CMPA_SECURE_BOOT_CFG_RSA4K_MASK)

#define FLASH_CMPA_SECURE_BOOT_CFG_TZM_IMAGE_TYPE_MASK (0x300U)
#define FLASH_CMPA_SECURE_BOOT_CFG_TZM_IMAGE_TYPE_SHIFT (8U)
/*! TZM_IMAGE_TYPE - TrustZone-M mode
 *  0b00..TZ-M image mode is taken from application image header
 *  0b01..TZ-M disabled image, boots to non-secure mode
 *  0b10..TZ-M enabled image, boots to secure mode
 *  0b11..TZ-M enabled image with TZ-M preset, boot to secure mode TZ-M pre-configured by data from application image header
 */
#define FLASH_CMPA_SECURE_BOOT_CFG_TZM_IMAGE_TYPE(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_SECURE_BOOT_CFG_TZM_IMAGE_TYPE_SHIFT)) & FLASH_CMPA_SECURE_BOOT_CFG_TZM_IMAGE_TYPE_MASK)

#define FLASH_CMPA_SECURE_BOOT_CFG_BLOCK_SET_KEY_MASK (0xC00U)
#define FLASH_CMPA_SECURE_BOOT_CFG_BLOCK_SET_KEY_SHIFT (10U)
/*! BLOCK_SET_KEY - Block PUF key code generation
 *  0b00..Allow PUF Key Code generation
 *  0b01..Disable PUF Key Code generation
 *  0b10..Disable PUF Key Code generation
 *  0b11..Disable PUF Key Code generation
 */
#define FLASH_CMPA_SECURE_BOOT_CFG_BLOCK_SET_KEY(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_SECURE_BOOT_CFG_BLOCK_SET_KEY_SHIFT)) & FLASH_CMPA_SECURE_BOOT_CFG_BLOCK_SET_KEY_MASK)

#define FLASH_CMPA_SECURE_BOOT_CFG_SKIP_BOOT_SEED_MASK (0x30000U)
#define FLASH_CMPA_SECURE_BOOT_CFG_SKIP_BOOT_SEED_SHIFT (16U)
/*! SKIP_BOOT_SEED - Skip boot seed computation
 *  0b00..Enable BOOT_SEED
 *  0b01..Disable BOOT_SEED
 *  0b10..Disable BOOT_SEED
 *  0b11..Disable BOOT_SEED
 */
#define FLASH_CMPA_SECURE_BOOT_CFG_SKIP_BOOT_SEED(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_SECURE_BOOT_CFG_SKIP_BOOT_SEED_SHIFT)) & FLASH_CMPA_SECURE_BOOT_CFG_SKIP_BOOT_SEED_MASK)

#define FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_INC_NXP_CFG_MASK (0xC0000U)
#define FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_INC_NXP_CFG_SHIFT (18U)
/*! BOOT_SEED_INC_NXP_CFG - Include NXP area in BOOT SEED computation
 *  0b00..not included
 *  0b01..included
 *  0b10..included
 *  0b11..included
 */
#define FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_INC_NXP_CFG(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_INC_NXP_CFG_SHIFT)) & FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_INC_NXP_CFG_MASK)

#define FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_CUST_CFG_MASK (0x300000U)
#define FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_CUST_CFG_SHIFT (20U)
/*! BOOT_SEED_CUST_CFG - Include Customer factory area (including keys) in BOOT SEED computation.
 *  0b00..not included
 *  0b01..included
 *  0b10..included
 *  0b11..included
 */
#define FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_CUST_CFG(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_CUST_CFG_SHIFT)) & FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_CUST_CFG_MASK)

#define FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_INC_SEC_EPOCH_MASK (0xC00000U)
#define FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_INC_SEC_EPOCH_SHIFT (22U)
/*! BOOT_SEED_INC_SEC_EPOCH - Include security EPOCH in BOOT_SEED computation.
 *  0b00..not included
 *  0b01..included
 *  0b10..included
 *  0b11..included
 */
#define FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_INC_SEC_EPOCH(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_INC_SEC_EPOCH_SHIFT)) & FLASH_CMPA_SECURE_BOOT_CFG_BOOT_SEED_INC_SEC_EPOCH_MASK)

#define FLASH_CMPA_SECURE_BOOT_CFG_SEC_BOOT_EN_MASK (0xC0000000U)
#define FLASH_CMPA_SECURE_BOOT_CFG_SEC_BOOT_EN_SHIFT (30U)
/*! SEC_BOOT_EN - Secure boot enable
 *  0b00..Plain image (internal flash with or without CRC)
 *  0b01..Boot signed images. (internal flash, RSA signed)
 *  0b10..Boot signed images. (internal flash, RSA signed)
 *  0b11..Boot signed images. (internal flash, RSA signed)
 */
#define FLASH_CMPA_SECURE_BOOT_CFG_SEC_BOOT_EN(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_SECURE_BOOT_CFG_SEC_BOOT_EN_SHIFT)) & FLASH_CMPA_SECURE_BOOT_CFG_SEC_BOOT_EN_MASK)
/*! @} */

/*! @name PRINCE_CFG - Prince Configuration */
/*! @{ */

#define FLASH_CMPA_PRINCE_CFG_GEE_MASK           (0x2U)
#define FLASH_CMPA_PRINCE_CFG_GEE_SHIFT          (1U)
/*! GEE - Global Encryption Enable */
#define FLASH_CMPA_PRINCE_CFG_GEE(x)             (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_PRINCE_CFG_GEE_SHIFT)) & FLASH_CMPA_PRINCE_CFG_GEE_MASK)

#define FLASH_CMPA_PRINCE_CFG_GDE_MASK           (0x20U)
#define FLASH_CMPA_PRINCE_CFG_GDE_SHIFT          (5U)
/*! GDE - Global Decryption Enable */
#define FLASH_CMPA_PRINCE_CFG_GDE(x)             (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_PRINCE_CFG_GDE_SHIFT)) & FLASH_CMPA_PRINCE_CFG_GDE_MASK)

#define FLASH_CMPA_PRINCE_CFG_SLK_MASK           (0x200U)
#define FLASH_CMPA_PRINCE_CFG_SLK_SHIFT          (9U)
/*! SLK - System Lock Enable */
#define FLASH_CMPA_PRINCE_CFG_SLK(x)             (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_PRINCE_CFG_SLK_SHIFT)) & FLASH_CMPA_PRINCE_CFG_SLK_MASK)

#define FLASH_CMPA_PRINCE_CFG_GLK_MASK           (0x2000U)
#define FLASH_CMPA_PRINCE_CFG_GLK_SHIFT          (13U)
/*! GLK - Global Lock Enable */
#define FLASH_CMPA_PRINCE_CFG_GLK(x)             (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_PRINCE_CFG_GLK_SHIFT)) & FLASH_CMPA_PRINCE_CFG_GLK_MASK)
/*! @} */

/*! @name NPX_REGION_KEY_DIR_BMAPCTX - Bitmap Control for Memory Context 0..Bitmap Control for Memory Context 3 */
/*! @{ */

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN0_MASK (0x1U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN0_SHIFT (0U)
/*! BEN0 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN0(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN0_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN0_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN1_MASK (0x2U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN1_SHIFT (1U)
/*! BEN1 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN1(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN1_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN1_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN2_MASK (0x4U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN2_SHIFT (2U)
/*! BEN2 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN2(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN2_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN2_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN3_MASK (0x8U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN3_SHIFT (3U)
/*! BEN3 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN3(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN3_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN3_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN4_MASK (0x10U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN4_SHIFT (4U)
/*! BEN4 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN4(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN4_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN4_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN5_MASK (0x20U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN5_SHIFT (5U)
/*! BEN5 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN5(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN5_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN5_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN6_MASK (0x40U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN6_SHIFT (6U)
/*! BEN6 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN6(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN6_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN6_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN7_MASK (0x80U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN7_SHIFT (7U)
/*! BEN7 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN7(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN7_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN7_MASK)

