zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_FLASH_CMPA.h
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN8_MASK (0x100U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN8_SHIFT (8U)
/*! BEN8 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN8(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN8_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN8_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN9_MASK (0x200U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN9_SHIFT (9U)
/*! BEN9 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN9(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN9_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN9_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN10_MASK (0x400U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN10_SHIFT (10U)
/*! BEN10 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN10(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN10_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN10_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN11_MASK (0x800U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN11_SHIFT (11U)
/*! BEN11 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN11(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN11_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN11_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN12_MASK (0x1000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN12_SHIFT (12U)
/*! BEN12 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN12(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN12_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN12_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN13_MASK (0x2000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN13_SHIFT (13U)
/*! BEN13 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN13(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN13_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN13_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN14_MASK (0x4000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN14_SHIFT (14U)
/*! BEN14 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN14(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN14_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN14_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN15_MASK (0x8000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN15_SHIFT (15U)
/*! BEN15 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN15(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN15_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN15_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN16_MASK (0x10000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN16_SHIFT (16U)
/*! BEN16 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN16(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN16_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN16_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN17_MASK (0x20000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN17_SHIFT (17U)
/*! BEN17 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN17(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN17_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN17_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN18_MASK (0x40000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN18_SHIFT (18U)
/*! BEN18 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN18(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN18_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN18_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN19_MASK (0x80000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN19_SHIFT (19U)
/*! BEN19 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN19(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN19_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN19_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN20_MASK (0x100000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN20_SHIFT (20U)
/*! BEN20 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN20(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN20_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN20_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN21_MASK (0x200000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN21_SHIFT (21U)
/*! BEN21 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN21(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN21_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN21_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN22_MASK (0x400000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN22_SHIFT (22U)
/*! BEN22 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN22(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN22_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN22_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN23_MASK (0x800000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN23_SHIFT (23U)
/*! BEN23 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN23(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN23_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN23_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN24_MASK (0x1000000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN24_SHIFT (24U)
/*! BEN24 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN24(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN24_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN24_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN25_MASK (0x2000000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN25_SHIFT (25U)
/*! BEN25 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN25(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN25_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN25_MASK)

