zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_FLASH_CMPA.h
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN26_MASK (0x4000000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN26_SHIFT (26U)
/*! BEN26 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN26(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN26_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN26_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN27_MASK (0x8000000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN27_SHIFT (27U)
/*! BEN27 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN27(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN27_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN27_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN28_MASK (0x10000000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN28_SHIFT (28U)
/*! BEN28 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN28(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN28_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN28_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN29_MASK (0x20000000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN29_SHIFT (29U)
/*! BEN29 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN29(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN29_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN29_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN30_MASK (0x40000000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN30_SHIFT (30U)
/*! BEN30 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN30(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN30_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN30_MASK)

#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN31_MASK (0x80000000U)
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN31_SHIFT (31U)
/*! BEN31 - Block enable for encryption/decryption
 *  0b0..Disable encryption/decryption
 *  0b1..Enable encryption/decryption
 */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN31(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN31_SHIFT)) & FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_BEN31_MASK)
/*! @} */

/* The count of FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX */
#define FLASH_CMPA_NPX_REGION_KEY_DIR_BMAPCTX_COUNT (4U)

/*! @name BLE_UNIQUE_ADDRESS0 - BLE_UNIQUE_ADDRESS part 1 */
/*! @{ */

#define FLASH_CMPA_BLE_UNIQUE_ADDRESS0_BLE_UNIQUE_ADDRESS_31_0_MASK (0xFFFFFFFFU)
#define FLASH_CMPA_BLE_UNIQUE_ADDRESS0_BLE_UNIQUE_ADDRESS_31_0_SHIFT (0U)
/*! BLE_UNIQUE_ADDRESS_31_0 - Bits 31 downto 0 of the BLE Unique Address to be used when BLE_UNIQUE_ADDRESS_VALID field is equal to 0xC3A5 */
#define FLASH_CMPA_BLE_UNIQUE_ADDRESS0_BLE_UNIQUE_ADDRESS_31_0(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_BLE_UNIQUE_ADDRESS0_BLE_UNIQUE_ADDRESS_31_0_SHIFT)) & FLASH_CMPA_BLE_UNIQUE_ADDRESS0_BLE_UNIQUE_ADDRESS_31_0_MASK)
/*! @} */

/*! @name BLE_UNIQUE_ADDRESS1 - BLE_UNIQUE_ADDRESS part 2 */
/*! @{ */

#define FLASH_CMPA_BLE_UNIQUE_ADDRESS1_BLE_UNIQUE_ADDRESS_47_32_MASK (0xFFFFU)
#define FLASH_CMPA_BLE_UNIQUE_ADDRESS1_BLE_UNIQUE_ADDRESS_47_32_SHIFT (0U)
/*! BLE_UNIQUE_ADDRESS_47_32 - Bits 47 downto 32 of the BLE Unique Address to be used when BLE_UNIQUE_ADDRESS_VALID field is equal to 0xC3A5 */
#define FLASH_CMPA_BLE_UNIQUE_ADDRESS1_BLE_UNIQUE_ADDRESS_47_32(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_BLE_UNIQUE_ADDRESS1_BLE_UNIQUE_ADDRESS_47_32_SHIFT)) & FLASH_CMPA_BLE_UNIQUE_ADDRESS1_BLE_UNIQUE_ADDRESS_47_32_MASK)

#define FLASH_CMPA_BLE_UNIQUE_ADDRESS1_BLE_UNIQUE_ADDRESS_VALID_MASK (0xFFFF0000U)
#define FLASH_CMPA_BLE_UNIQUE_ADDRESS1_BLE_UNIQUE_ADDRESS_VALID_SHIFT (16U)
/*! BLE_UNIQUE_ADDRESS_VALID - Use 48-bit value from BLE_UNIQUE_ADDRESS field as BLE address when
 *    this field is equal to 0xC3A5. If this field is different from 0xC3A5, check
 *    BLE_DEFAULT_ADDRESS_VALID field in NMPA to know which address to use.
 */
#define FLASH_CMPA_BLE_UNIQUE_ADDRESS1_BLE_UNIQUE_ADDRESS_VALID(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_BLE_UNIQUE_ADDRESS1_BLE_UNIQUE_ADDRESS_VALID_SHIFT)) & FLASH_CMPA_BLE_UNIQUE_ADDRESS1_BLE_UNIQUE_ADDRESS_VALID_MASK)
/*! @} */

/*! @name FLASH_REMAP_SIZE - This 32-bit register contains the size of the image to remap, in bytes. */
/*! @{ */

#define FLASH_CMPA_FLASH_REMAP_SIZE_FLASH_REMAP_SIZE_MASK (0xFFFFFFFFU)
#define FLASH_CMPA_FLASH_REMAP_SIZE_FLASH_REMAP_SIZE_SHIFT (0U)
/*! FLASH_REMAP_SIZE - This 32-bit register contains the size of the image to remap, in bytes. */
#define FLASH_CMPA_FLASH_REMAP_SIZE_FLASH_REMAP_SIZE(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_FLASH_REMAP_SIZE_FLASH_REMAP_SIZE_SHIFT)) & FLASH_CMPA_FLASH_REMAP_SIZE_FLASH_REMAP_SIZE_MASK)
/*! @} */

/*! @name FLASH_REMAP_OFFSET - This 32-bit register contains the offset by which the image is to be remapped. */
/*! @{ */

#define FLASH_CMPA_FLASH_REMAP_OFFSET_FLASH_REMAP_OFFSET_MASK (0xFFFFFFFFU)
#define FLASH_CMPA_FLASH_REMAP_OFFSET_FLASH_REMAP_OFFSET_SHIFT (0U)
/*! FLASH_REMAP_OFFSET - This 32-bit register contains the offset by which the image is to be remapped. */
#define FLASH_CMPA_FLASH_REMAP_OFFSET_FLASH_REMAP_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_FLASH_REMAP_OFFSET_FLASH_REMAP_OFFSET_SHIFT)) & FLASH_CMPA_FLASH_REMAP_OFFSET_FLASH_REMAP_OFFSET_MASK)
/*! @} */

/*! @name ROTKH - ROTKH0 for Root of Trust Keys Table hash[255:224]..ROTKH7 for Root of Trust Keys Table hash[31:0] */
/*! @{ */

#define FLASH_CMPA_ROTKH_FIELD_MASK              (0xFFFFFFFFU)
#define FLASH_CMPA_ROTKH_FIELD_SHIFT             (0U)
#define FLASH_CMPA_ROTKH_FIELD(x)                (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_ROTKH_FIELD_SHIFT)) & FLASH_CMPA_ROTKH_FIELD_MASK)
/*! @} */

/*! @name CUSTOMER_DEFINED - Customer Defined (Programable through ROM API) */
/*! @{ */

#define FLASH_CMPA_CUSTOMER_DEFINED_FIELD_MASK   (0xFFFFFFFFU)
#define FLASH_CMPA_CUSTOMER_DEFINED_FIELD_SHIFT  (0U)
/*! FIELD - . */
#define FLASH_CMPA_CUSTOMER_DEFINED_FIELD(x)     (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_CUSTOMER_DEFINED_FIELD_SHIFT)) & FLASH_CMPA_CUSTOMER_DEFINED_FIELD_MASK)
/*! @} */

/*! @name SHA256_DIGEST - SHA256_DIGEST0 for DIGEST[31:0]..SHA256_DIGEST7 for DIGEST[255:224] */
/*! @{ */

#define FLASH_CMPA_SHA256_DIGEST_FIELD_MASK      (0xFFFFFFFFU)
#define FLASH_CMPA_SHA256_DIGEST_FIELD_SHIFT     (0U)
/*! FIELD - . */
#define FLASH_CMPA_SHA256_DIGEST_FIELD(x)        (((uint32_t)(((uint32_t)(x)) << FLASH_CMPA_SHA256_DIGEST_FIELD_SHIFT)) & FLASH_CMPA_SHA256_DIGEST_FIELD_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group FLASH_CMPA_Register_Masks */


/*!
 * @}
 */ /* end of group FLASH_CMPA_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_FLASH_CMPA_H_ */

